Community-PIO-CH32V/platform-ch32v/misc/svd/CH570.svd
                <register>
                    <name>R8_LONG_RST_CFG</name>
                    <description>RWA, Long reset configuration register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_LONG_RST_EN</name>
                            <description>RWA, Long reset enable</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_LONG_TIM_SEL</name>
                            <description>RWA, Long reset duration selection</description>
                            <bitRange>[2:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register> 
                <register>
                    <name>R8_SLP_CLK_OFF2</name>
                    <description>RWA, Sleep clock control register 2</description>
                    <addressOffset>0x1D</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_CLK_OFF_XROM</name>
                            <description>RWA, Turn off the 64M or 600M clock of the FLASH controller</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLK_OFF_DEBUG</name>
                            <description>RWA, Close the two-wire debugging 32M clock</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLK_OFF_HCLK</name>
                            <description>RWA, Turn off the HCLK clock of the FLASH controller</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>                      
                    </fields>
                </register> 
                <register>
                    <name>R16_SLP_WAKE_CFG</name>
                    <description>RWA, Sleep clock control register</description>
                    <addressOffset>0x1E</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0100</resetValue>
                    <fields>
                        <field>
                            <name>RB_OSCCLK_RDY_KEEP</name>
                            <description>RWA, During Halt sleep, the peripheral clock remains on</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PRECLK_CNT_EN</name>
                            <description>RWA, When waking up from sleep, it takes a certain amount of time to release HCLK</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PRECLK_CNT_SEL</name>
                            <description>RWA, Sleep time configuration, sleep duration=number of cycles * Fsys</description>
                            <bitRange>[6:5]</bitRange>
                            <access>Read-Write</access>
                        </field>  
                        <field>
                            <name>RB_ACAUTO_ENABLE</name>
                            <description>RWA, The secure register channel automatically closes</description>
                            <bitRange>[8:8]</bitRange>
                            <access>Read-Write</access>
                        </field>                    
                    </fields>
                </register>                 
                <register>
                    <name>R16_POWER_PLAN</name>
                    <description>RWA, power plan before sleep instruction, SAM</description>
                    <addressOffset>0x20</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x11CF</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWR_XROM</name>
                            <description>RWA, power for FlashROM</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_RAM12K</name>
                            <description>RWA, SRAM power supply for RAM12K</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_CORE</name>
                            <description>RWA, power retention for core and base peripherals</description>
                            <bitRange>[2:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_EXTEND</name>
                            <description>RWA, power retention for USB and BLE</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_MAIN_ACT</name>
                            <description>RWA, Main power selection</description>
                            <bitRange>[6:6]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_SYS_EN</name>
                            <description>RWA, power for system</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_LDO5V_EN</name>
                            <description>RWA, Internal LDO5V control</description>
                            <bitRange>[8:8]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PWR_PLAN_EN</name>
                            <description>RWA, Enable sleep power planning and control</description>
                            <bitRange>[15:15]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_AUX_POWER_ADJ</name>
                    <description>RWA, aux power adjust control, SAM</description>
                    <addressOffset>0x22</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0XXX</resetValue>
                    <fields>
                        <field>
                            <name>RB_ULPLDO_ADJ</name>
                            <description>RWA, Output voltage regulation value of auxiliary power supply for ultra-low power consumption LDO</description>
                            <bitRange>[2:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CFG_IVREF</name>
                            <description>RO, retain. The original value must be kept unchanged when writing</description>
                            <bitRange>[11:8]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_BAT_DET_CTRL</name>
                    <description>RWA, battery voltage detector control, SAM</description>
                    <addressOffset>0x24</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWR_LDO_EN</name>
                            <description>RWA, - </description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_BAT_MON_EN</name>
                            <description>RWA, Enable low-power battery voltage monitoring function</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_BAT_LOW_IE</name>
                            <description>RWA, Battery low voltage interrupt enable</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_BAT_DET_CFG</name>
                    <description>RWA, battery voltage detector configuration, SAM</description>
                    <addressOffset>0x25</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x02</resetValue>
                    <fields>
                        <field>
                            <name>RB_BAT_LOW_VTH</name>
                            <description>RWA, select threshold voltage of battery voltage low</description>
                            <bitRange>[1:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_BAT_STATUS</name>
                    <description>RO, battery status</description>
                    <addressOffset>0x26</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_BAT_STAT_LOW</name>
                            <description>RO, battery low voltage status, high action</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_LSI_CONFIG</name>
                    <description>RWA, LSI configure register</description>
                    <addressOffset>0x2F</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xX2</resetValue>
                    <fields>
                        <field>
                            <name>RB_CLK_LSI_PON</name>
                            <description>RWA, Internal low-frequency RC oscillator LSI power control bit</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_LSI_CLK_PIN</name>
                            <description>RO, LSI clock pin status (asynchronous signal)</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
