Community-PIO-CH32V/platform-ch32v/misc/svd/CH570.svd
            </registers>
        </peripheral>    
        <peripheral>
            <name>RTC</name>
            <description>Real time clock</description>
            <groupName>RTC</groupName>
            <baseAddress>0x40001000</baseAddress>
            <addressBlock>
                <offset>0x30</offset>
                <size>0x0F</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RTC</name>
                <description>RTC_IRQHandler</description>
                <value>28</value>
            </interrupt>
            <registers>
                <register>
                    <name>R8_RTC_FLAG_CTRL</name>
                    <description>RWA, Real time clock</description>
                    <addressOffset>0x30</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x30</resetValue>
                    <fields>
                        <field>
                            <name>RB_RTC_TMR_CLR</name>
                            <description>RW, set 1 to clear RTC timer action flag, auto clear</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_RTC_TRIG_CLR</name>
                            <description>RW, set 1 to clear RTC trigger action flag, auto clear</description>
                            <bitRange>[5:5]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_RTC_TMR_FLAG</name>
                            <description>RO, RTC timer action flag</description>
                            <bitRange>[6:6]</bitRange>
                            <access>Read-Only</access>
                        </field>
                        <field>
                            <name>RB_RTC_TRIG_FLAG</name>
                            <description>RO, RTC trigger action flag</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_RTC_MODE_CTRL</name>
                    <description>RWA, RTC mode control, SAM</description>
                    <addressOffset>0x31</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xC2</resetValue>
                    <fields>
                        <field>
                            <name>RB_RTC_TMR_MODE</name>
                            <description>RWA, RTC timer mode: 000=0.125S, 001=0.25S, 010=0.5S, 011=1S, 100=2S, 101=4S, 110=8S, 111=16S</description>
                            <bitRange>[2:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_RTC_IGNORE_B0</name>
                            <description>RWA, force ignore bit0 for trigger mode: 0=compare bit0, 1=ignore bit0</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_RTC_TMR_EN</name>
                            <description>RWA, RTC timer mode enable</description>
                            <bitRange>[4:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_RTC_TRIG_EN</name>
                            <description>RWA, RTC trigger mode enable</description>
                            <bitRange>[5:5]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_RTC_LOAD_LO</name>
                            <description>RWA, set 1 to load RTC count low word R32_RTC_CNT_32K, auto clear after loaded</description>
                            <bitRange>[6:6]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_RTC_LOAD_HI</name>
                            <description>RWA, set 1 to load RTC count high word R32_RTC_CNT_DAY, auto clear after loaded</description>
                            <bitRange>[7:7]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_RTC_TRIG</name>
                    <description>RWA, RTC trigger value, SAM</description>
                    <addressOffset>0x34</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R32_RTC_TRIG</name>
                            <description>RWA, RTC trigger value</description>
                            <bitRange>[31:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_RTC_CNT_LSI</name>
                    <description>RO, RTC count based lsi</description>
                    <addressOffset>0x38</addressOffset>
                    <size>16</size>
                    <access>Read-Only</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_RTC_CNT_LSI</name>
                            <description>R0,RTC count based lsi</description>
                            <bitRange>[15:0]</bitRange>
                            <access>Read-Only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_RTC_CNT_DIV1</name>
                    <description>RO, RTC count based 65536 LSI clock cycles</description>
                    <addressOffset>0x3A</addressOffset>
                    <size>16</size>
                    <access>Read-Only</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_RTC_CNT_DIV1</name>
                            <description>RO, RTC count based 65536 LSI clock cycles</description>
                            <bitRange>[15:0]</bitRange>
                            <access>Read-Only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_RTC_CNT_DIV2</name>
                    <description>RO, RTC count based 2831155200 LSI clock cycles, only low 14 bit</description>
                    <addressOffset>0x3C</addressOffset>
                    <size>32</size>
                    <access>Read-Only</access>
                    <resetValue>0xXXXXXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R32_RTC_CNT_DIV2</name>
                            <description>RWA,RTC count based 2831155200 LSI clock cycles</description>
                            <bitRange>[13:0]</bitRange>
                            <access>Read-Only</access>
                        </field>
                    </fields>
                </register>
