Community-PIO-CH32V/platform-ch32v/misc/svd/CH570.svd
            </registers>    
        </peripheral>
        <peripheral>
            <name>CMP</name>
            <description>Comparer</description>
            <groupName>CMP</groupName>
            <baseAddress>0x40001000</baseAddress>
            <addressBlock>
                <offset>0x54</offset>
                <size>0x32</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>CMP</name>
                <description>CMP_IRQHandler</description>
                <value>29</value>
            </interrupt>
            <registers>
                <register>
                    <name>R32_CMP_CTRL</name>
                    <description>RW, Comparator control register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RB_CMP_EN</name>
                            <description>RW, Comparator enabled</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CMP_CAP</name>
                            <description>RW, Timer captures channel signal source selection</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CMP_SW</name>
                            <description>RW, Comparator channel selection</description>
                            <bitRange>[3:2]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CMP_NREF_LEVEL</name>
                            <description>RW, Selection of negative reference level for comparator</description>
                            <bitRange>[7:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CMP_INT</name>
                            <description>RW, Comparator interrupt enable</description>
                            <bitRange>[8:8]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CMP_OUT_SEL</name>
                            <description>RW, Comparator interrupt generates event selection</description>
                            <bitRange>[11:10]</bitRange>
                            <access>Read-Only</access>
                        </field>
                        <field>
                            <name>RB_CMP_IF</name>
                            <description>RW1, Comparator interrupt flag, write 1 to reset to zero</description>
                            <bitRange>[16:16]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_APR_OUT_CMP</name>
                            <description>RW, Real time output signal of comparator</description>
                            <bitRange>[25:25]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>KEYSCAN</name>
            <description>keys scanning</description>
            <groupName>KEYSCAN</groupName>
            <baseAddress>0x40001000</baseAddress>
            <addressBlock>
                <offset>0x64</offset>
                <size>0x16</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>KEYSCAN</name>
                <description>KEYSCAN_IRQHandler</description>
                <value>33</value>
            </interrupt>
            <registers>
                <register>
                    <name>R16_KEY_SCAN_CTRL</name>
                    <description>RW, Key scan control register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_SCAN_START_EN</name>
                            <description>RW, Start scanning enable</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SCAN_CNT_END</name>
                            <description>RW, Set the number of times to scan to the same key value</description>
                            <bitRange>[3:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SCAN_CLK_DIV</name>
                            <description>RW, Scan clock frequency division</description>
                            <bitRange>[7:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_SCAN_EN</name>
                            <description>RW, Enable I/O pins involved in key scanning</description>
                            <bitRange>[12:8]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SCAN_1END_WAKE_EN</name>
                            <description>RW, Activate wake-up signal after a single scan</description>
                            <bitRange>[13:13]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLR_WAKEUP_EN</name>
                            <description>RW, Enable automatic clearing of wake-up signal after wake-up</description>
                            <bitRange>[14:14]</bitRange>
                            <access>Read-Only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_KEY_SCAN_INT_EN</name>
                    <description>RW, Press button scan interrupt enable register</description>
                    <addressOffset>0x66</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_KEY_PRESSED_IE</name>
                            <description>RW, Detected key press and interrupted when the same key value is reached the set value</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SCAN_1END_IE</name>
                            <description>RW, Interrupt enable after a single scan is completed</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_KEY_SCAN_INT_FLAG</name>
                    <description>RW, Press the button to scan the interrupt flag register</description>
                    <addressOffset>0x67</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_KEY_PRESSED_IF</name>
                            <description>RW, Detected button press, and the same button value reaches the set value for the number of times interrupt flag</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SCAN_1END_IF</name>
                            <description>RW, Interrupt flag after word scanning is completed</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_KEY_SCAN_NUMB</name>
                    <description>RW, Scan key number register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>Read-Only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RB_KEY_SCAN_NUMB</name>
                            <description>RO, Current key number value</description>
                            <bitRange>[19:0]</bitRange>
                            <access>Read-Only</access>
                        </field>
                        <field>
                            <name>RB_KEY_SCAN_CNT</name>
                            <description>RO, Current number of key scans</description>
                            <bitRange>[22:20]</bitRange>
                            <access>Read-Only</access>
                        </field>
                    </fields>
                </register>
