Community-PIO-CH32V/platform-ch32v/misc/svd/CH570.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>GPIO</name>
            <description>General porpose intput output</description>
            <groupName>GPIO</groupName>
            <baseAddress>0x40001000</baseAddress>
            <addressBlock>
                <offset>0x90</offset>
                <size>0x4C</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>GPIOA</name>
                <description>GPIOA_IRQHandler</description>
                <value>17</value>
            </interrupt>           
            <registers>
                <register>
                    <name>R16_PA_INT_EN</name>
                    <description>RW, GPIO PA interrupt enable</description>
                    <addressOffset>0x90</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PA_INT_EN</name>
                            <description>GPIO PA interrupt enable</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PA_INT_MODE</name>
                    <description>RW, GPIO PA interrupt mode: 0=level action, 1=edge action</description>
                    <addressOffset>0x94</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PA_INT_MODE</name>
                            <description>  GPIO PA interrupt mode</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PA_INT_IF</name>
                    <description>RW1, GPIO PA interrupt flag</description>
                    <addressOffset>0x9C</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PA_INT_IF</name>
                            <description> GPIO PA interrupt flag</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_DIR</name>
                    <description>RW, GPIO PA I/O direction: 0=in, 1=out</description>
                    <size>32</size>
                    <addressOffset>0xA0</addressOffset>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_DIR_0</name>
                            <description> GPIO PA I/O direction byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_DIR_1</name>
                            <description> GPIO PA I/O direction byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_PIN</name>
                    <description>RO, GPIO PA input</description>
                    <addressOffset>0xA4</addressOffset>
                    <size>32</size>
                    <access>Read-Only</access>
                    <resetValue>0x0000XXXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_PIN_0</name>
                            <description>GPIO PA input byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_PIN_1</name>
                            <description>GPIO PA input byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_OUT</name>
                    <description>RW, GPIO PA output</description>
                    <addressOffset>0xA8</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_OUT_0</name>
                            <description>GPIO PA output byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_OUT_1</name>
                            <description>GPIO PA output byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_CLR</name>
                    <description>WZ, GPIO PA clear output: 0=keep, 1=clear</description>
                    <addressOffset>0xAC</addressOffset>
                    <size>32</size>
                    <access>Write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_CLR_0</name>
                            <description>GPIO PA clear output byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_CLR_1</name>
                            <description>GPIO PA clear output byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_PU</name>
                    <description>RW, GPIO PA pullup resistance enable</description>
                    <addressOffset>0xB0</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_PU_0</name>
                            <description>GPIO PA pullup resistance enable byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_PU_1</name>
                            <description>GPIO PA pullup resistance enable byte 0</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_PD_DRV</name>
                    <description>RW, PA pulldown for input or PA driving capability for output</description>
                    <addressOffset>0xB4</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_PD_DRV_0</name>
                            <description>PA pulldown for input or PA driving capability for output byte 0</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_PD_DRV_1</name>
                            <description>PA pulldown for input or PA driving capability for output byte 1</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PA_SET</name>
                    <description>RW, PA port output set register</description>
                    <addressOffset>0xB8</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R8_PA_SET_0</name>
                            <description>When the corresponding bit of the set register R3_2PA_SET is 0, the output of the PA pin remains unchanged; When it is 1, the PA pin outputs a high level</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PA_SET_1</name>
                            <description>When the corresponding bit of the set register R3_2PA_SET is 0, the output of the PA pin remains unchanged; When it is 1, the PA pin outputs a high level</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                    </fields>
                </register>
