Community-PIO-CH32V/platform-ch32v/misc/svd/CH570.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>KEYSCAN</name>
            <description>keys scanning</description>
            <groupName>KEYSCAN</groupName>
            <baseAddress>0x40001000</baseAddress>
            <addressBlock>
                <offset>0x64</offset>
                <size>0x16</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>KEYSCAN</name>
                <description>KEYSCAN_IRQHandler</description>
                <value>33</value>
            </interrupt>
            <registers>
                <register>
                    <name>R16_KEY_SCAN_CTRL</name>
                    <description>RW, Key scan control register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>RB_SCAN_START_EN</name>
                            <description>RW, Start scanning enable</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SCAN_CNT_END</name>
                            <description>RW, Set the number of times to scan to the same key value</description>
                            <bitRange>[3:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SCAN_CLK_DIV</name>
                            <description>RW, Scan clock frequency division</description>
                            <bitRange>[7:4]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_PIN_SCAN_EN</name>
                            <description>RW, Enable I/O pins involved in key scanning</description>
                            <bitRange>[12:8]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SCAN_1END_WAKE_EN</name>
                            <description>RW, Activate wake-up signal after a single scan</description>
                            <bitRange>[13:13]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_CLR_WAKEUP_EN</name>
                            <description>RW, Enable automatic clearing of wake-up signal after wake-up</description>
                            <bitRange>[14:14]</bitRange>
                            <access>Read-Only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_KEY_SCAN_INT_EN</name>
                    <description>RW, Press button scan interrupt enable register</description>
                    <addressOffset>0x66</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_KEY_PRESSED_IE</name>
                            <description>RW, Detected key press and interrupted when the same key value is reached the set value</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SCAN_1END_IE</name>
                            <description>RW, Interrupt enable after a single scan is completed</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_KEY_SCAN_INT_FLAG</name>
                    <description>RW, Press the button to scan the interrupt flag register</description>
                    <addressOffset>0x67</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_KEY_PRESSED_IF</name>
                            <description>RW, Detected button press, and the same button value reaches the set value for the number of times interrupt flag</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SCAN_1END_IF</name>
                            <description>RW, Interrupt flag after word scanning is completed</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_KEY_SCAN_NUMB</name>
                    <description>RW, Scan key number register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>32</size>
                    <access>Read-Only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RB_KEY_SCAN_NUMB</name>
                            <description>RO, Current key number value</description>
                            <bitRange>[19:0]</bitRange>
                            <access>Read-Only</access>
                        </field>
                        <field>
                            <name>RB_KEY_SCAN_CNT</name>
                            <description>RO, Current number of key scans</description>
                            <bitRange>[22:20]</bitRange>
                            <access>Read-Only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_ENC_REG_CTRL</name>
                    <description>RW, Encoder mode control register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_START_ENC_EN</name>
                            <description>RW, Enable encoder mode operation</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_SMS_MODE</name>
                            <description>RW, Encoder mode edge working mode</description>
                            <bitRange>[2:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_RD_CLR_EN</name>
                            <description>RW, Encoder mode reads count and resets to zero</description>
                            <bitRange>[3:3]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_ENC_DIR</name>
                            <description>RO, Current direction of encoder</description>
                            <bitRange>[5:5]</bitRange>
                            <access>Read-Only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_ENC_INTER_EN</name>
                    <description>RW, Encoder mode interrupt enable register</description>
                    <addressOffset>0x21</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_IE_DIR_INC</name>
                            <description>RW, Encoder mode forward interrupt enable</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_IE_DIR_DEC</name>
                            <description>RW, Encoder mode backward interrupt enable</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_ENC_INT_FLAG</name>
                    <description>RW, Encoder mode interrupt flag register</description>
                    <addressOffset>0x22</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_IF_DIR_INC</name>
                            <description>RW, Encoder mode forward interrupt flag</description>
                            <bitRange>[0:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                        <field>
                            <name>RB_IF_DIR_DEC</name>
                            <description>RW, Encoder mode backward interrupt flag</description>
                            <bitRange>[1:1]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_ENC_REG_CEND</name>
                    <description>RW, Encoder mode final value configuration register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R32_ENC_REG_CEND</name>
                            <description>RW, Preset encoder mode final value</description>
                            <bitRange>[31:0]</bitRange>
                            <access>Read-Write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_ENC_REG_CCNT</name>
                    <description>RW, Encoder mode current value configuration register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>32</size>
                    <access>Read-Only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>R32_ENC_REG_CCNT</name>
                            <description>RO, Current encoder mode value</description>
                            <bitRange>[31:0]</bitRange>
                            <access>Read-Only</access>
                        </field>
                    </fields>
                </register>
