Community-PIO-CH32V/platform-ch32v/misc/svd/CH570.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>SPI</name>
            <description>SPI register</description>
            <groupName>SPI</groupName>
            <baseAddress>0x40004000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>SPI</name>
                <description>SPI_IRQHandler</description>
                <value>19</value>
            </interrupt>
            <registers>
                <register>
                    <name>R8_SPI_CTRL_MOD</name>
                    <description>RW, SPI mode control</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x02</resetValue>
                    <fields>
                        <field>
                            <name>RB_SPI_MODE_SLAVE</name>
                            <description>RW, SPI slave mode: 0=master or host, 1=slave or device</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_ALL_CLEAR</name>
                            <description>RW, force clear SPI FIFO and count</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_2WIRE_MOD</name>
                            <description>RW, SPI enable 2 wire mode for slave: 0=3wire(SCK0,MOSI,MISO), 1=2wire(SCK0,MISO=MXSX)</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_MST_SCK_MOD/RB_SPI_SLV_CMD_MOD</name>
                            <description>RW, SPI master clock mode: 0=mode 0, 1=mode 3;RW, SPI slave command mode: 0=byte stream, 1=first byte command</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_FIFO_DIR</name>
                            <description>RW, SPI FIFO direction: 0=out(write @master mode), 1=in(read @master mode)</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_SCK_OE</name>
                            <description>RW, SPI SCK output enable</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_MOSI_OE</name>
                            <description>RW, SPI MOSI output enable</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_MISO_OE</name>
                            <description>RW, SPI MISO output enable</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI_CTRL_CFG</name>
                    <description>RW, SPI configuration control</description>
                    <addressOffset>0x01</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_SPI_DMA_ENABLE</name>
                            <description>RW, SPI DMA enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_MST_CLK_SEL</name>
                            <description>RW, When RB_SPI-PODE_SLAVE=0, select the main clock polarity; When RB_SPI-PODE_SLAVE=1, select the input and output direction for the two-wire mode slave machine</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_DMA_LOOP</name>
                            <description>RW, SPI DMA address loop enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_AUTO_IF</name>
                            <description>RW, enable buffer/FIFO accessing to auto clear RB_SPI_IF_BYTE_END interrupt flag</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_BIT_ORDER</name>
                            <description>RW, SPI bit data order: 0=MSB first, 1=LSB first</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_MST_DLY_EN</name>
                            <description>RW, SPI master input delay enable</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI_INTER_EN</name>
                    <description>RW, SPI interrupt enable</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_SPI_IE_CNT_END</name>
                            <description>RW, enable interrupt for SPI total byte count end</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IE_BYTE_END</name>
                            <description>RW, enable interrupt for SPI byte exchanged</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IE_FIFO_HF</name>
                            <description>RW, enable interrupt for SPI FIFO half</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IE_DMA_END</name>
                            <description>RW, enable interrupt for SPI DMA completion</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IE_FIFO_OV</name>
                            <description>RW, enable interrupt for SPI FIFO overflow</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IE_FST_BYTE</name>
                            <description>RW, enable interrupt for SPI slave mode first byte received</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI_CLOCK_DIV/R8_SPI_SLAVE_PRE</name>
                    <description>RW, SPI master clock divisor;RW, SPI slave preset value</description>
                    <addressOffset>0x03</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x10</resetValue>
                    <fields>
                        <field>
                            <name>R8_SPI_CLOCK_DIV/R8_SPI_SLAVE_PRE</name>
                            <description>RW, SPI master clock divisor;RW, SPI slave preset value</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI_BUFFER</name>
                    <description>RW, SPI data buffer</description>
                    <addressOffset>0x04</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_SPI_BUFFER</name>
                            <description>RW, SPI data buffer</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI_RUN_FLAG</name>
                    <description>RO, SPI work flag</description>
                    <addressOffset>0x05</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_SPI_SLV_CMD_ACT</name>
                            <description>RO, SPI slave first byte or  command flag</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_FIFO_READY</name>
                            <description>RO, SPI FIFO ready status</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_SLV_CS_LOAD</name>
                            <description>RO, SPI slave chip-select loading status</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_SLV_SELECT</name>
                            <description>RO, SPI slave selection status</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI_INT_FLAG</name>
                    <description>RW1, SPI interrupt flag</description>
                    <addressOffset>0x06</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x40</resetValue>
                    <fields>
                        <field>
                            <name>RB_SPI_IF_CNT_END</name>
                            <description>RW1, interrupt flag for SPI total byte count end</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IF_BYTE_END</name>
                            <description>RW1, interrupt flag for SPI byte exchanged</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IF_FIFO_HF</name>
                            <description>RW1, interrupt flag for SPI FIFO half </description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IF_DMA_END</name>
                            <description>RW1, interrupt flag for SPI DMA completion</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IF_FIFO_OV</name>
                            <description>RW1, interrupt flag for SPI FIFO overflow</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_FREE</name>
                            <description>RO, current SPI free status</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IF_FST_BYTE</name>
                            <description>RW1, interrupt flag for SPI slave mode first byte received</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI_FIFO_COUNT</name>
                    <description>RW, SPI FIFO count status</description>
                    <addressOffset>0x07</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_SPI_FIFO_COUNT</name>
                            <description>RW, SPI FIFO count status</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI_INT_TYPE</name>
                    <description>RW, SPI interrupt trigger mode selection register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_SPI_INT_TYPE</name>
                            <description>RW, SPI interrupt trigger mode selection</description>
                            <bitRange>[4:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI_INTER1_EN</name>
                    <description>RW, SPI Interrupt 1 Enable Register</description>
                    <addressOffset>0x09</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_SPI_IE_FIFO_EMPTY</name>
                            <description>RW, Current FIFO data air break enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IE_FIFO_FULL</name>
                            <description>RW, Current FIFO data full interrupt enabled</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI_INT1_FLAG</name>
                    <description>RW1, SPI interrupt 1 flag register</description>
                    <addressOffset>0x0A</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_SPI_IF_FIFO_EMPTY</name>
                            <description>RW1, Current FIFO data empty flag bit</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_SPI_IE_FIFO_FULL</name>
                            <description>RW1, Current FIFO data full flag</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                    </fields>
                </register>                
                <register>
                    <name>R16_SPI_TOTAL_CNT</name>
                    <description>RW, SPI total byte count, only low 12 bit</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_SPI_TOTAL_CNT</name>
                            <description>RW, SPI total byte count, only low 12 bit</description>
                            <bitRange>[11:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI_FIFO</name>
                    <description>RO/WO, SPI FIFO register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0xXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_SPI_FIFO</name>
                            <description>RO/WO, SPI FIFO register</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_SPI_FIFO_COUNT1</name>
                    <description>RO, SPI FIFO count status</description>
                    <addressOffset>0x13</addressOffset>
                    <size>8</size>
                    <access>Read-Only</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>R8_SPI_FIFO_COUNT1</name>
                            <description>RO, SPI FIFO count status</description>
                            <bitRange>[3:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_SPI_DMA_NOW</name>
                    <description>RW, SPI DMA current address</description>
                    <addressOffset>0x14</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x000XXXXX</resetValue>
                    <fields>
                        <field>
                            <name>RB_SPI_DMA_NOW</name>
                            <description>RW, SPI DMA current address</description>
                            <bitRange>[13:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_SPI_DMA_BEG</name>
                    <description>RW, SPI DMA begin address</description>
                    <addressOffset>0x18</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x000XXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R32_SPI_DMA_BEG</name>
                            <description>RW, SPI DMA begin address</description>
                            <bitRange>[13:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_SPI_DMA_END</name>
                    <description>RW, SPI DMA end address</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0x000XXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R32_SPI_DMA_END</name>
                            <description>RW, SPI DMA end address</description>
                            <bitRange>[13:0]</bitRange>
                        </field>
                    </fields>
                </register>
