Community-PIO-CH32V/platform-ch32v/misc/svd/CH570.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>PWMx</name>
            <description>PWMx register</description>
            <groupName>PWMx</groupName>
            <baseAddress>0x40005000</baseAddress>
            <addressBlock>
                <offset>0x00</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>PWMx</name>
                <description>PWMX_IRQHandler</description>
                <value>31</value>
            </interrupt>
            <registers>
                <register>
                    <name>R8_PWM_OUT_EN</name>
                    <description>RW, PWM output enable control</description>
                    <addressOffset>0x00</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWM1_OUT_EN</name>
                            <description>RW, PWM1 output enable</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM2_OUT_EN</name>
                            <description>RW, PWM2 output enable</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM3_OUT_EN</name>
                            <description>RW, PWM3 output enable</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM4_OUT_EN</name>
                            <description>RW, PWM4 output enable</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM5_OUT_EN</name>
                            <description>RW, PWM5 output enable</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_PWM_POLAR</name>
                    <description>RW, PWM output polarity control</description>
                    <addressOffset>0x01</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWM1_POLAR</name>
                            <description>RW, PWM1 output polarity: 0=default low and high action, 1=default high and low action</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM2_POLAR</name>
                            <description>RW, PWM2 output polarity: 0=default low and high action, 1=default high and low action</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM3_POLAR</name>
                            <description>RW, PWM3 output polarity: 0=default low and high action, 1=default high and low action</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM4_POLAR</name>
                            <description>RW, PWM4 output polarity: 0=default low and high action, 1=default high and low action</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM5_POLAR</name>
                            <description>RW, PWM5 output polarity: 0=default low and high action, 1=default high and low action</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_PWM_CONFIG</name>
                    <description>RW, PWM configuration</description>
                    <addressOffset>0x02</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x0X</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWM_CYCLE_SEL</name>
                            <description>RW, PWM cycle selection: 0=256;128;64;32 clocks, 1=255;127;63;31 clocks</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM_CYC_MOD</name>
                            <description>RW, PWM data width mode: 00=8 bits data, 01=7 bits data, 10=6 bits data, 11=5 bits data</description>
                            <bitRange>[2:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM4_5_STAG_EN</name>
                            <description>RW, PWM4/5 stagger output enable: 0=independent output, 1=stagger output</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM4_5_CH</name>
                            <description>RW, PWM4/5 channel output status</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM_SYNC_START</name>
                            <description>RW, Sync Start</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM_SYNC_EN</name>
                            <description>RW, Synchronization enablement allows</description>
                            <bitRange>[7:7]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_PWM_DMA_CTRL</name>
                    <description>RW, PWMx DMA control register</description>
                    <addressOffset>0x03</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_DMA_ENABLE</name>
                            <description>RW, DMA enabled (only valid when the data width is 16)</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_DMA_ADDR_LOOP</name>
                            <description>RW, DMA Loop Output Enable</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_DMA_SEL</name>
                            <description>RW, DMA output channel selection when RB_PWM_SYNC_EN=0</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PWM1_3_DATA</name>
                    <description>RW, PWM data retention register group 1</description>
                    <addressOffset>0x04</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXXXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_PWM1_DATA/R16_PWM1_DATA</name>
                            <description>RW, PWM1 data holding or PWM1 data holding(16bits wide)</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PWM2_DATA/R16_PWM1_DATA</name>
                            <description>RW, PWM2 data holding or PWM1 data holding(16bits wide)</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R8_PWM3_DATA/R16_PWM2_DATA</name>
                            <description>RW, PWM3 data holding or PWM2 data holding(16bits wide)</description>
                            <bitRange>[23:16]</bitRange>
                        </field> 
                        <field>
                            <name>R16_PWM2_DATA</name>
                            <description>RW, PWM2 data holding(16bits wide)</description>
                            <bitRange>[31:24]</bitRange>
                        </field>                                               
                    </fields>
                </register>
                <register>
                    <name>R16_PWM3_DATA</name>
                    <description>RW, PWM data retention register group 2</description>
                    <addressOffset>0x08</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_PWM3_DATA</name>
                            <description>RW, PWM3 data retention register</description>
                            <bitRange>[15:0]</bitRange>
                        </field>                                              
                    </fields>
                </register>                
                <register>
                    <name>R32_PWM4_5_DATA</name>
                    <description>RW, PWM data retention register group 3</description>
                    <addressOffset>0x10</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXXXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R8_PWM4_DATA/R16_PWM4_DATA</name>
                            <description>RW, PWM4 data holding or PWM4 data holding(16bits wide)</description>
                            <bitRange>[7:0]</bitRange>
                        </field>
                        <field>
                            <name>R8_PWM5_DATA/R16_PWM4_DATA</name>
                            <description>RW, PWM5 data holding or PWM4 data holding(16bits wide)</description>
                            <bitRange>[15:8]</bitRange>
                        </field>
                        <field>
                            <name>R16_PWM5_DATA</name>
                            <description>RW, PWM5 data holding(16bits wide)</description>
                            <bitRange>[32:16]</bitRange>
                        </field> 
                    </fields>
                </register>
                <register>
                    <name>R8_PWM_INT_EN</name>
                    <description>RW, PWMx interrupt enable register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWM_IE_CYC</name>
                            <description>RW, End of PWM1/2/3 cycle interrupt enable bit</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM_CYC_PRE</name>
                            <description>RW, Select the interrupt time point at the end of the PWM cycle</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM1_IE_CYC</name>
                            <description>RW, End of PWM4/5 cycle interrupt enable bit</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM_IE_FIFO</name>
                            <description>RW, FIFO data less than 4 interrupt enable bits</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM_IE_DMA</name>
                            <description>RW, DMA transfer end interrupt enable bit</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM_IE_OVER</name>
                            <description>RW, FIFO read air interrupt enable bit</description>
                            <bitRange>[6:6]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R8_PWM_INT_FLAG</name>
                    <description>RW1, PWMx interrupt flag register</description>
                    <addressOffset>0x0D</addressOffset>
                    <size>8</size>
                    <access>Read-Write</access>
                    <resetValue>0x00</resetValue>
                    <fields>
                        <field>
                            <name>RB_PWM_IF_CYC</name>
                            <description>RW1, PWM1/2/3 cycle end flag</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM1_IF_CYC</name>
                            <description>RW1, PWM4/5 cycle end flag</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM_IF_FIFO</name>
                            <description>RW1, FIFO data less than 4 interrupt flag bits</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM_IF_DMA</name>
                            <description>RW1, DMA transfer end interrupt flag bit</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>RB_PWM_IF_OVER</name>
                            <description>RW1, FIFO overflow interrupt flag bit</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PWM_CYC_VALUE</name>
                    <description>RW, PWM1/2/3 cycles end register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R16_PWM_CYC_VALUE</name>
                            <description>RW, PWM1/2/3 clock cycle at 16 data widths</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R16_PWM_CLOCK_DIV</name>
                    <description>RW, PWM reference clock frequency division coefficient</description>
                    <addressOffset>0x18</addressOffset>
                    <size>16</size>
                    <access>Read-Write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>R16_PWM_CLOCK_DIV</name>
                            <description>RW, DMA data buffer current address</description>
                            <bitRange>[15:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PWM_DMA_NOW</name>
                    <description>RW, Current address of PWMx DMA buffer</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXXXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R32_PWM_DMA_NOW</name>
                            <description>RW, Current address of PWMx DMA buffer</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PWM_DMA_BEG</name>
                    <description>RW, Starting address of PWMx DMA buffer</description>
                    <addressOffset>0x20</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXXXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R32_PWM_DMA_BEG</name>
                            <description>RW, Starting address of PWMx DMA buffer</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_PWM_DMA_END</name>
                    <description>RW, End of PWMx DMA buffer</description>
                    <addressOffset>0x24</addressOffset>
                    <size>32</size>
                    <access>Read-Write</access>
                    <resetValue>0xXXXXXXXX</resetValue>
                    <fields>
                        <field>
                            <name>R32_PWM_DMA_END</name>
                            <description>RW, End of PWMx DMA buffer</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
