Community-PIO-CH32V/platform-ch32v/misc/svd/CH570.svd
                <register>
                    <name>R32_PFIC_SCTLR</name>
                    <displayName>SCTLR</displayName>
                    <description>System Control Register</description>
                    <addressOffset>0xD10</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SLEEPONEXIT</name>
                            <description>RW,SLEEPONEXIT</description>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>SLEEPDEEP</name>
                            <description>RW,SLEEPDEEP</description>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>WFITOWFE</name>
                            <description>RW,WFITOWFE</description>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>SEVONPEND</name>
                            <description>RW,SEVONPEND</description>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>SETEVENT</name>
                            <description>WO,SETEVENT</description>
                            <bitRange>[5:5]</bitRange>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>Systick</name>
            <description>Systick register</description>
            <groupName>Systick</groupName>
            <baseAddress>0xE000F000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x100</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>R32_STK_CTLR</name>
                    <displayName>STK_CTLR</displayName>
                    <description>Systick counter control register</description>
                    <addressOffset>0x00</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>STE</name>
                            <description>Systick counter enable</description>
                            <access>Read-Write</access>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>STIE</name>
                            <description>Systick counter interrupt enable</description>
                            <access>Read-Write</access>
                            <bitRange>[1:1]</bitRange>
                        </field>
                        <field>
                            <name>STCLK</name>
                            <description>System counter clock Source selection</description>
                            <access>Read-Write</access>
                            <bitRange>[2:2]</bitRange>
                        </field>
                        <field>
                            <name>STRE</name>
                            <description>System counter reload control</description>
                            <access>Read-Write</access>
                            <bitRange>[3:3]</bitRange>
                        </field>
                        <field>
                            <name>MODE</name>
                            <description>counter mode</description>
                            <access>Read-Write</access>
                            <bitRange>[4:4]</bitRange>
                        </field>
                        <field>
                            <name>SWIE</name>
                            <description>RW0,System soft interrupt enable</description>
                            <access>Read-Write</access>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_STK_SR</name>
                    <description>Systick count status register</description>
                    <addressOffset>0x04</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNTIF</name>
                            <description>RW, CNTIF</description>
                            <bitRange>[0:0]</bitRange>
                        </field>
                        <field>
                            <name>SWIE</name>
                            <description>RW, Enable software interrupt triggering</description>
                            <bitRange>[31:31]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_STK_CNTL</name>
                    <description>Systick counter low register</description>
                    <addressOffset>0x08</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNTL</name>
                            <description>RW, CNTL</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_STK_CMPLR</name>
                    <description>Count reload low register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNTH</name>
                            <description>RW,CNTH</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_STK_CMPLR</name>
                    <description>Systick compare low register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CMPL</name>
                            <description>RW,CMPL</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>R32_STK_CMPHR</name>
                    <description>Systick compare high register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>Read-Write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CMPH</name>
                            <description>RW, Set the reload counter value to the lower 32 bits</description>
                            <bitRange>[31:0]</bitRange>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>
